'''GIT'''
# распределенная система контроля версий (система, записывающая изменения в файле или наборе файлов). Используется для отслеживания и ведения истории изменения файлов, позволяет вернуть старую версию кода

'''GitHub'''
# онлайн сервис - который предоставляет услуги по хранению репозиториев и управлению доступом
# (аналоги GitLab, Bitbucket)


'''Команды'''
# git init -> первращает директорию в git репозиторий (инициализируете директорию и пояевляется скрытая директория .git) вводится только один раз

# git add .(все содержимое директории)/ <filaname> (конкретный файл git add test.py) -> отслеживание файлов или файла gitом 

# git commit -m 'message' -> создание коммита с коментарием, сохранение в git (локально на компе)

# git remote add <название_связи> (обычно origin) ссылка_на_удаленный_рапозиторий (HTTPS/SSH) -> связываем локальный репозиторий с удаленным

# git push <название_связи> <название_ветки> (master/main) -> оправкаверсии колда на удаленный репозиторий (в github репозиторий)


